Autodesk.Revit.DB.ACADExportOptions.HatchBackgroundColor
The color that will be set as hatch backgound color on the exported hatch.
This color will be used only if useHatchBackgroundColor is true.
default value is white
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.ACADExportOptions.UseHatchBackgroundColor
Indicates if hatch background color will be used or not.
default value is false.
Since:
2018

Autodesk.Revit.DB.ACADExportOptions.FileVersion
ACADVersion::Default
Default value is ACADVersion.Default.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.ACADExportOptions.NonplotSuffix
If the MarkNonplotLayers attribute is set to true, all layers with names containing this suffix will be marked as non-plot.
No action will be performed if the suffix is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.ACADExportOptions.MarkNonplotLayers
If true and the nonplot layer suffix is not empty, all layers whose names contain that suffix will be marked as non-plot.
Remarks:
A typical use would be to mark as non-plot all layers containing -NPLT.
Default value is false

Autodesk.Revit.DB.ACADExportOptions.ExportingAreas
True to export area and room geometry, false otherwise.
Default value is false.

Autodesk.Revit.DB.ACADExportOptions.SharedCoords
True to use the shared coordinate system's origin, false to use the project origin.
Default value is false.

Autodesk.Revit.DB.ACADExportOptions.TargetUnit
The target unit type.
Default value is ExportUnit.Default.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.ACADExportOptions.ACAPreference
The preferred way to generate geometry of ACA objects.
Default value is ACAObjectPreference.Object.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.ACADExportOptions.ExportOfSolids
The mode used to export solids in 3D views.
Default value is SolidGeometry.Polymesh.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.ACADExportOptions.TextTreatment
The text treatment.
Deault value is TextTreatment.Exact.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.ACADExportOptions.LinetypesFileName
The custom linetype file name (*.lin).
Default value is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.ACADExportOptions.LineScaling
The scaling mode for the line type.
Default value is LineScaling.ViewScale.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.ACADExportOptions
The base class for options used to export DWG and DXF format files.